In [ ]:
# PANDAS -> 데이터 정제

In [ ]:
# NUMPY -> 수치데이터를 다루는 라이브러리 
#           ; 다차원 행렬 자료구조인 ndarray를 이용해 벡터 및 행렬을 사용하는 선형대수 계산에서 주로 사용

# numpy.zeros((a,b)) -> axb사이즈의 영행렬 생성
# numpy.ones((a,b)) -> axb사이즈의 모든 원소가 1인 행렬 생성
# numpy.eye(n) -> 단위행렬(행렬 a와 행렬곱을 했을 때 똑같이 행렬 a가 나오는 행렬) ; 대각선으로 1이 할당, 그 외 0 할당
# numpy.random.random((a,b)) -> a에서 b사이의 랜덤값 반환
# numpy.full() -> 행렬의 모든 값을 10으로 초기화
# numpy.arange() -> default) 0부터 n-1까지의 원소값을 가지는 배열 생성
# numpy.arange(i,j,k) -> i부터 j까지 k씩 증가하는 원소값을 가지는 배열 생성

# + -> add()    - -> subtract()    * -> multiply()     / -> divide()

# 행렬곱 -> @(;연산자) or dot()(함수)

In [ ]:
# !pip install matplotlib

# Matplotlib -> 데이터 시각화(차트, 플롯)(; 파이 차트, 바 차트, 라인 플롯, Scatter)

# plot(x축리스트, y축리스트, 옵션...) -> matplotlib.pyplot 에 위치, 값들은 리스트로 입력, x는 자동으로 0,1,2,3...(default)로 지정됨
# xx_chart = matplotlib.pyplot.plot()
# xx_chart.show() 를 통해 차트를 실제로 그림

# pyplot.xlabel() or ylabel() -> 그래프의 x,y축에 대한 레이블 표시(각 축에 대한 이름 지정)
# pypot.~~() -> ㅌ,
# pyplot.legend() -> 그래프 라인의 범례 추가,
#                    매개변수로 loc="위치(upper center등과 같이 str 지정 or 코드 지정)" 지정 시 지정 위치에 범례 나타남


# pyplot.subplot(row,col,pos) -> 행의 수, 열의 수, 위치(어느 위치에 거칠지ㅒ)

In [ ]:
!pip install pandas

In [ ]:
import pandas as pd

In [ ]:
pd_list = pd.Series([5000, 6000, 6500,6500], index=["아메리카노","카페라떼","카페모카","카푸치노"])

In [ ]:
print(pd_list)

In [ ]:
print("시리즈 형태의 데이터에서 index 값: ", pd_list.index)
print("시리즈 형태의 데이터에서 value 값: ", pd_list.values)

In [ ]:
# 2차원 데이터셋 DataFrame = 여러 Series를 합한 것 ; 분리도 가능
# 데이터프레임 생성

_value = [[1,2,3],[4,5,6],[7,8,9]]
_index = ['a','b','c']
_column = ['A','B','C']

df = pd.DataFrame(data=_value, index=_index, columns=_column)
df

In [ ]:
print("데이터프레임의 index 값: ", df.index)
print("데이터프레임의 column 값: ", df.columns)
print("데이터프레임의 value 값:\n", df.values)

In [ ]:
# 딕셔너리 형태의 데이터를 이용해 데이터프레임 생성

_value = {
    "name":["test","test2","test3"],
    "age":[20,30,25],
    "phone":["01012345667","01022223333","01043215432"]
    }

print(_value)

In [ ]:
# 딕셔너리의 키가 컬럼명이 됨
df2 = pd.DataFrame(_value)

df2

In [ ]:
df2["age"]

In [ ]:
df2.age

In [ ]:
## 경로
#1.절대경로 ; 환경이 바뀌어도 항상 같은 장소를 가리킴 -> full path
#2.상대경로 ; 환경에 따라 가리키는 장소가 달라짐 ->  ./ (현재위치)  ../(상위)   폴더명/(하위폴더)

In [ ]:
# .csv .tsv -> comma(tab) seperated value
# .json -> [{"a":"b"},...]

In [ ]:
# 코로나 데이터 로드
# 현재파일>csv>corona.csv

data=pd.read_csv("./csv/corona.csv")
# data=pd.read_csv("C:/Users/umjiwoo/OneDrive/문서/금융빅데이터 과정/ubion/csv/corona.csv")
data

In [ ]:
data.info()

In [ ]:
data2=pd.read_csv("./csv/num_1/chipotle.tsv", sep="\t")
data2

In [ ]:
data3=pd.read_json("./csv/2022/202205_expense_list.json")
data3

In [ ]:
!pip install openpyxl

data4=pd.read_excel("./csv/2022/202205_expense_list.xlsx")
data4

In [162]:
import pandas as pd
import numpy as np

_value = [
    [1,2,3],[4,np.nan,6],[7,np.nan,8]
]

df=pd.DataFrame(_value)
df

   0    1  2
0  1  2.0  3
1  4  NaN  6
2  7  NaN  8

In [163]:
# 결측치 확인 1. info()함수로 데이터프레임 정보 열람해 non-null값과 index값이 일치하는 지 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int64
 1   1       1 non-null      float64
 2   2       3 non-null      int64
dtypes: float64(1), int64(2)
memory usage: 200.0 bytes

In [164]:
df.columns = ['A','B','C']
df

   A    B  C
0  1  2.0  3
1  4  NaN  6
2  7  NaN  8

In [165]:
# 결측치 확인 2. is() or isna() 함수 사용해 확인

df.isna().sum  #이 값이 True면 그 값이 결측치

<bound method NDFrame._add_numeric_operations.<locals>.sum of        A      B      C
0  False  False  False
1  False   True  False
2  False   True  False>

In [159]:
# 결측치 확인 2_2. is() or isna() 함수 사용해 확인

df.isna()  #이 값이 True면 그 값이 결측치

       A      B      C
0  False  False  False
1  False   True  False
2  False   True  False

In [166]:
df.isna().sum()  #각 열별 결측치 개수 출력

A    0
B    2
C    0
dtype: int64

In [179]:
# 각 열에 결측치가 하나라도 있으면 True 리턴
is_na_by_c = df.isna().any(axis=0)
print(is_na_by_c)

A    False
B     True
C    False
dtype: bool

In [170]:
# 각 행에 결측치가 하나라도 있으면 True 리턴
is_na_data = df.isna().any(axis=1)
is_na_df = df.loc[is_na_data]

print(is_na_data)

print()

print(is_na_df)

0    False
1     True
2     True
dtype: bool

   A   B  C
1  4 NaN  6
2  7 NaN  8

In [ ]:
# 결측치 제거 -> dropna(axis) ; axis=x축을 지울지,y축을 지울지
# axis에 0,"rows"를 대입하면 해당되는 행을 삭제함
#        1,"columns"를 대입하면 해당되는 열을 삭제

df.dropna(axis=0)

In [ ]:
df.dropna(axis=1)

In [ ]:
# 데이터프레임 필터기능
# loc[행 조건or열 조건]->행이나 컬럼명 또는 bool타입으로 접근
# iloc[행 위치or열 위치]->인덱스값으로 접근
# 행 조건or위치를 지정하는 경우 하나만 써도 무방
# 열 조건or위치를 지정하는 경우 행 조건 없으면 ':'으로 채워주고 열 조건 지정

df.loc[0]

In [117]:
sales = pd.read_csv("./csv/Sales Records.csv")
sales.head(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.0
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.5

In [ ]:
# 0번째 행 데이터 출력
# 좌(컬럼명), 우(데이터값)
sales.loc[0]

In [ ]:
sales.iloc[0]

In [121]:
# Region==Asia인 데이터만 추출해서
is_asia = sales["Region"]=="Asia"
# loc 활용해 테이블로 보이기
asia_data = sales.loc[is_asia]
asia_data
# asia_data.info()

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
6,Asia,Laos,Vegetables,Online,L,2/20/2011,844532620,3/20/2011,4825,154.06,90.93,743339.50,438737.25,304602.25
7,Asia,China,Baby Food,Online,C,4/10/2017,564251220,5/12/2017,3330,255.28,159.42,850082.40,530868.60,319213.80
13,Asia,India,Household,Online,C,8/27/2016,151717174,9/2/2016,5338,668.27,502.54,3567225.26,2682558.52,884666.74
23,Asia,Japan,Cosmetics,Offline,H,9/19/2013,967895781,9/28/2013,725,437.20,263.33,316970.00,190914.25,126055.75
36,Asia,Bangladesh,Personal Care,Online,L,12/11/2016,246147668,1/13/2017,9420,81.73,56.67,769896.60,533831.40,236065.20
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9981,Asia,Kazakhstan,Clothes,Online,L,3/15/2012,691468608,4/25/2012,9782,109.28,35.84,1068976.96,350586.88,718390.08
9985,Asia,Brunei,Office Supplies,Offline,L,7/19/2017,144625842,7/24/2017,6855,651.21,524.96,4464044.55,3598600.80,865443.75
9990,Asia,Laos,Beverages,Offline,C,2/24/2015,651942288,2/28/2015,3066,47.45,31.79,145481.70,97468.14,48013.56
9995,Asia,Laos,Beverages,Online,H,7/15/2014,199342048,7/31/2014,8597,47.45,31.79,407927.65,273298.63,134629.02
9999,Asia,Mongolia,Snacks,Offline,M,4/12/2016,824410903,4/16/2016,361,152.58,97.44,55081.38,35175.84,19905.54

In [122]:
sales['Region']

0                 Sub-Saharan Africa
1                             Europe
2       Middle East and North Africa
3                 Sub-Saharan Africa
4                             Europe
                    ...
9995                            Asia
9996                          Europe
9997              Sub-Saharan Africa
9998              Sub-Saharan Africa
9999                            Asia
Name: Region, Length: 10000, dtype: object

In [123]:
print(sales.loc[:,['Region']])

                            Region
0               Sub-Saharan Africa
1                           Europe
2     Middle East and North Africa
3               Sub-Saharan Africa
4                           Europe
...                            ...
9995                          Asia
9996                        Europe
9997            Sub-Saharan Africa
9998            Sub-Saharan Africa
9999                          Asia

[10000 rows x 1 columns]

In [125]:
print(sales.loc[is_asia,['Sales Channel']])

     Sales Channel
6           Online
7           Online
13          Online
23         Offline
36          Online
...            ...
9981        Online
9985       Offline
9990       Offline
9995        Online
9999       Offline

[1469 rows x 1 columns]

In [183]:
sales.isna().sum()  #sales데이터에는 결측치 없음

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        0
Total Profit      0
dtype: int64

In [186]:
uriage = pd.read_csv("./csv/uriage.csv")

In [187]:
uriage.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   object
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
dtypes: float64(1), object(3)
memory usage: 93.8+ KB

In [188]:
uriage.isna().sum()

purchase_date      0
item_name          0
item_price       387
customer_name      0
dtype: int64

In [205]:
u_is_na = uriage.isna().any(axis=1)
uriage.loc[u_is_na]

         purchase_date item_name  item_price customer_name
1     2019-07-13 13:05     상 품 S         NaN           김우찬
2     2019-05-11 19:42     상 품 a         NaN           김유찬
4      2019-04-22 3:09       상품a         NaN           김강현
6     2019-05-18 19:16      상품 a         NaN           김재준
14    2019-06-11 12:57       상품A         NaN           김재호
...                ...       ...         ...           ...
2987  2019-01-04 13:05       상품K         NaN           김정훈
2990  2019-07-16 11:34       상품O         NaN           김서준
2992  2019-07-27 10:13       상품C         NaN           김동하
2996  2019-03-29 11:14       상품Q         NaN           김지율
2997  2019-07-14 12:56       상품H         NaN           김승주

[387 rows x 4 columns]

In [203]:
uriage.loc[~u_is_na]

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
3     2019-02-12 23:40       상품Z      2600.0           김재현
5     2019-03-20 19:16       상품S      1900.0           김우진
7      2019-04-18 0:14       상품V      2200.0           김민혁
8     2019-01-10 15:51       상품O      1500.0           김선우
...                ...       ...         ...           ...
2991  2019-02-18 14:36       상품W      2300.0           김우빈
2993   2019-01-25 3:57       상품C       300.0           김이안
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2998   2019-07-21 0:31       상품D       400.0           정준기

[2612 rows x 4 columns]

In [207]:
# dropna(axis=0) ; 결측치가 있는 데이터 행만 삭제
uriage.dropna(axis=0)

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
3     2019-02-12 23:40       상품Z      2600.0           김재현
5     2019-03-20 19:16       상품S      1900.0           김우진
7      2019-04-18 0:14       상품V      2200.0           김민혁
8     2019-01-10 15:51       상품O      1500.0           김선우
...                ...       ...         ...           ...
2991  2019-02-18 14:36       상품W      2300.0           김우빈
2993   2019-01-25 3:57       상품C       300.0           김이안
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2998   2019-07-21 0:31       상품D       400.0           정준기

[2612 rows x 4 columns]

In [209]:
# dropna(axis=1) ; 결측치가 있는 열 아예 날려버림
uriage.dropna(axis=1)

         purchase_date item_name customer_name
0     2019-06-13 18:02       상품A           김가온
1     2019-07-13 13:05     상 품 S           김우찬
2     2019-05-11 19:42     상 품 a           김유찬
3     2019-02-12 23:40       상품Z           김재현
4      2019-04-22 3:09       상품a           김강현
...                ...       ...           ...
2994   2019-02-15 2:56       상품Y           김정민
2995   2019-06-22 4:03       상품M           김재원
2996  2019-03-29 11:14       상품Q           김지율
2997  2019-07-14 12:56       상품H           김승주
2998   2019-07-21 0:31       상품D           정준기

[2999 rows x 3 columns]

### 통계 요약 정보 출력 함수

In [210]:
sales.describe()   
# mean값과 min+max평균 값의 차이가 많이 난다면 이상치 있을 가능성 의심해봐야//
# 이상치 경계: mean x 1.5 - std ~ mean x 1.5 + std (기본)

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+04,10000.000000,10000.000000,10000.000000,1.000000e+04,1.000000e+04,1.000000e+04
mean,5.498719e+08,5002.855900,268.143139,188.806639,1.333355e+06,9.382658e+05,3.950893e+05
std,2.607835e+08,2873.246454,217.944092,176.445907,1.465026e+06,1.145914e+06,3.775550e+05
min,1.000892e+08,2.000000,9.330000,6.920000,1.679400e+02,1.245600e+02,4.338000e+01
25%,3.218067e+08,2530.750000,109.280000,56.670000,2.885511e+05,1.647855e+05,9.832914e+04
50%,5.485663e+08,4962.000000,205.700000,117.110000,8.000512e+05,4.816058e+05,2.890990e+05
75%,7.759981e+08,7472.000000,437.200000,364.690000,1.819143e+06,1.183822e+06,5.664227e+05
max,9.999342e+08,10000.000000,668.270000,524.960000,6.680027e+06,5.241726e+06,1.738178e+06